===
Basic struct definition
===

struct pizza {
	toppings : [PizzaTopping; 5]
}

---
(source_file
	(struct_definition
		(identifier)
		(struct_field
			(identifier)
			(type_array
				(identifier)
				(number_literal)))))

===
Structs with multiple fields
===

struct pizza {
	toppings : [PizzaTopping; 5],
	numSlices : i32,
	thinCrust : bool
}

---
(source_file
	(struct_definition
		(identifier)
		(struct_field
			(identifier)
			(type_array
				(identifier)
				(number_literal)))
		(struct_field
			(identifier)
			(type_i32))
		(struct_field
			(identifier)
			(type_bool))))

===
Struct parametrized by types
===

struct identity<T> {
	field : T
}

---
(source_file
	(struct_definition
		(identifier)
		(identifier)
		(struct_field
			(identifier)
			(identifier))))

===
Multiple type parameters
===

struct Pair<A, B> {
	fst : A,
	snd : B
}

---
(source_file
	(struct_definition
		(identifier)
		(identifier)
		(identifier)
		(struct_field
			(identifier)
			(identifier))
		(struct_field
			(identifier)
			(identifier))))
